zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_centroid.c
/***************************************************************************//**
* \file cy_capsense_centroid.c
* \version 10.0.0
*
* \brief
* This file provides the source code for the centroid calculation methods
* of the CAPSENSE&trade; middleware.
*
********************************************************************************
* \copyright
* (c) 2018-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/


#include <string.h>
#include <stddef.h>
#include <stdint.h>
#include "cy_syslib.h"
#include "cy_capsense_centroid.h"
#include "cy_capsense_common.h"
#include "cy_capsense_lib.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_filter.h"
#include "cycfg_capsense_defines.h"

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP))

/*******************************************************************************
* Local definition
*******************************************************************************/
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_LENGTH        (3u)
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_PREVIOUS      (0u)
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_CENTER        (1u)
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_NEXT          (2u)
#define CY_CAPSENSE_LINEAR_SLIDER_MIN_SNS_COUNT         (2u)

/* Minimum valid age */
#define CY_CAPSENSE_CSX_TOUCHPAD_AGE_START              (0x0100u)
#define CY_CAPSENSE_CSX_TOUCHPAD_Z_SHIFT                (0x04u)
#define CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT             (8u)
#define CY_CAPSENSE_CENTROID_ROUND_VALUE                (0x7Fu)
#define CY_CAPSENSE_NO_LOCAL_MAX                        (0xFFFFu)

#define CY_CAPSENSE_TOUCHPAD_MIN_SNS_NUMBER             (2u)

#define CY_CAPSENSE_INPUT_ARRAY_SIZE                    (5u)
#define CY_CAPSENSE_INPUT_ARRAY_SIZE_HALF               (CY_CAPSENSE_INPUT_ARRAY_SIZE / 2)

/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/
#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    static void Cy_CapSense_TransferTouch(
                    uint32_t newIndex,
                    uint32_t oldIndex,
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    static void Cy_CapSense_NewTouch(
                    uint32_t newIndex,
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    static uint32_t Cy_CapSense_CalcDistance(
                    uint32_t newIndex,
                    uint32_t oldIndex,
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    static void Cy_CapSense_Hungarian(
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    static void Cy_CapSense_CopyTouchRecord(
                    cy_stc_capsense_position_t * destination,
                    const cy_stc_capsense_position_t * source);
#endif
#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    __STATIC_INLINE void Cy_CapSense_TouchDownDebounce(
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    __STATIC_INLINE void Cy_CapSense_SortByAge(
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif
#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
    __STATIC_INLINE uint8_t Cy_CapSense_GetLowestId(uint8_t idMask);
#endif

#if (CY_CAPSENSE_SLIDER_CENTROID_5X_EN)
    static void Cy_Capsense_SliderPeakDetect(
                    cy_capsense_advanced_slider_t * ptrAdvSlider,
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
    static void Cy_Capsense_SliderDetectTouchZone(
                    cy_capsense_advanced_slider_t * ptrAdvSlider,
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
    static uint16_t Cy_Capsense_SliderCalculatePositionNormalFinger(
                    uint8_t idxPeak,
                    cy_capsense_advanced_slider_t * ptrAdvSlider,
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
    static uint16_t Cy_Capsense_SliderCalculatePositionFatFinger(
                    uint8_t idxPeak,
                    cy_capsense_advanced_slider_t * ptrAdvSlider,
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
#endif

/** \} \endcond */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_DIPLEX_SLIDER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpCentroidDiplex
****************************************************************************//**
*
* Finds touch position of a Linear slider widget with enabled diplexing.
*
* In scope of position searching this function finds the local maximum with the
* highest raw count. If such maximums are more than one, then the maximum with the
* bigger sum of neighboring sensors is taken for further processing. Then the position
* is calculated using centroid algorithm with three sensors.
*
* At least two neighboring sensors should cross finger threshold. Then the algorithm 
* is able to distinguish where real touch is located (direct part of slider or
* diplex part of slider) and corresponding position is reported. Otherwise no 
* touch is reported.
*
* This function does not detect two or more touches.
* 
* \param newTouch
* The pointer to the touch structure where found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpCentroidDiplex(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t sum;
    uint32_t diffM;
    uint32_t diffP;
    uint32_t snsIndex;
    const cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    const uint8_t * ptrDpxTable;
    uint32_t snsCount = ptrWdConfig->numSns;
    
    uint32_t maxSum = 0u;
    uint32_t maxDiff = 0u;
    uint32_t maxIndex = CY_CAPSENSE_NO_LOCAL_MAX;
    uint32_t threshold = ptrWdConfig->ptrWdContext->fingerTh;
    int32_t numerator = 0;
    int32_t denominator = 0;
    uint32_t multiplier;
    uint32_t offset;
    
