zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_centroid.c
    threshold -= ptrWdConfig->ptrWdContext->hysteresis;
    ptrDpxTable = ptrWdConfig->ptrDiplexTable;
    
    /* Find maximum signal */
    ptrSnsCxt = ptrWdConfig->ptrSnsContext;
    for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
    {
        if (maxDiff < ptrSnsCxt->diff)
        {
            maxDiff = ptrSnsCxt->diff;
        }
        ptrSnsCxt++;
    }

    /* Find sensor index with maximum sum ([i-1],[i],[i+1]) including diplex part */
    ptrSnsCxt = ptrWdConfig->ptrSnsContext;
    for (snsIndex = 0u; snsIndex < (snsCount << 1u); snsIndex++)
    {
        /* Potential maximum */
        if (maxDiff == ptrSnsCxt[ptrDpxTable[snsIndex]].diff)
        {
            /* Get sum of differences around maximum */
            diffM = (snsIndex > 0u) ? ptrSnsCxt[ptrDpxTable[snsIndex - 1u]].diff : 0u;
            diffP = (snsIndex < ((snsCount << 1u) - 1u)) ? ptrSnsCxt[ptrDpxTable[snsIndex + 1u]].diff : 0u;
            sum = ptrSnsCxt[ptrDpxTable[snsIndex]].diff + diffM + diffP;
            if ((diffM < threshold) && (diffP < threshold))
            {
                sum = 0u;
            }
            if (maxSum < sum)
            {
                /* New maximum */
                maxIndex = snsIndex;
                maxSum = sum;
                numerator = (int32_t)diffP - (int32_t)diffM;
            }
        }
    }
    
    if ((maxIndex != CY_CAPSENSE_NO_LOCAL_MAX) && (maxSum > 0u))
    {
        multiplier = (uint32_t)ptrWdConfig->xResolution << 8u;
        /* Calculate position */
        if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CALC_METHOD_MASK))
        {
            multiplier /= ((snsCount << 1u) - 1u);
            offset = 0u;
        }
        else
        {
            multiplier /= (snsCount << 1u);
            offset = multiplier >> 1u;
        }
        
        denominator = (int32_t)maxSum;
        denominator = ((numerator * (int32_t)multiplier) / denominator) + (((int32_t)maxIndex * (int32_t)multiplier) + (int32_t)offset);
                    
        /* Round result and shift 8 bits left */
        newTouch->numPosition = CY_CAPSENSE_POSITION_ONE;
        newTouch->ptrPosition[0u].x = (uint16_t)(((uint32_t)denominator + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
    }
    else
    {
        newTouch->numPosition = CY_CAPSENSE_POSITION_NONE;
    }
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_DIPLEX_SLIDER_EN) */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_LINEAR_SLIDER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpCentroidLinear
****************************************************************************//**
*
* Finds the touch position of a Linear slider widget and classifies the touch
* object type (a normal finger, fat finger, or large object).
*
* The function performs the following steps:
* 1. Detects peak sensors whose diff exceeds the finger threshold.
* 2. Determines the touch zone around each peak by expanding left and right
*    while neighboring sensor signals satisfy the signal ratio condition.
* 3. Compares the touch zone width against fat finger and large object
*    size thresholds (adjusted by hysteresis based on the previous finger
*    type) to classify the touch as a normal finger, fat finger, or large
*    object.
* 4. Calculates the touch position using a three-sensor centroid for a normal
*    finger or a weighted centroid across the entire touch zone for a fat finger.
*
* This function does not detect two or more touches.
* 
* \param newTouch
* The pointer to the touch structure where the found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpCentroidLinear(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    #if (CY_CAPSENSE_SLIDER_CENTROID_5X_EN)
        /* Improved slider centroid algorithm variables. */
        cy_capsense_advanced_slider_t advSlider = {0};
        uint16_t touchZoneWidth;
        uint8_t idxPeak;
        uint16_t pos = 0u;
        uint16_t fatFingerTh;
        uint16_t largeObjTh;
        uint32_t lastFingerType = (ptrWdConfig->ptrWdContext->status & CY_CAPSENSE_WD_FINGER_TYPE_MASK) >> CY_CAPSENSE_WD_FINGER_TYPE_POS;

    #else
        /* Legacy three-sensor centroid algorithm variables. */
        uint32_t snsIndex = 0u;
        uint32_t snsCount = ptrWdConfig->numSns;

        uint32_t diffM;
        uint32_t diffP;
        uint32_t sum = 0u;
        uint32_t maxSum = 0u;
        uint32_t maxDiff = 0u;
        uint32_t maxIndex = CY_CAPSENSE_NO_LOCAL_MAX;
        const cy_stc_capsense_sensor_context_t * ptrSnsCxt;
        int32_t numerator = 0;
        int32_t denominator = 0;
        uint32_t multiplier;
        uint32_t offset;
    #endif

    #if (CY_CAPSENSE_SLIDER_CENTROID_5X_EN)
        /* Improved slider centroid algorithm. */
        if (0u != (ptrWdConfig->centroidConfig & CY_CAPSENSE_CENTROID_5X5_MASK))
        {
            Cy_Capsense_SliderPeakDetect(&advSlider, ptrWdConfig);
            Cy_Capsense_SliderDetectTouchZone(&advSlider, ptrWdConfig);

            /* Copy thresholds to local variables to avoid accumulating subtraction */
            fatFingerTh = ptrWdConfig->ptrWdContext->minFatFingerSize;
            largeObjTh  = ptrWdConfig->ptrWdContext->minLargeObjectSize;

            /* Apply hysteresis only when previous finger type is known (not first touch) */
            if (lastFingerType != CY_CAPSENSE_FINGER_TYPE_NONE)
            {
                /* Fat finger threshold: lower only if previously fat (stay fat), raise if normal */
                if (lastFingerType == CY_CAPSENSE_FINGER_TYPE_FAT)
                {
                    fatFingerTh -= ptrWdConfig->minFatFingerSizeHyst;
                }
                else if (lastFingerType == CY_CAPSENSE_FINGER_TYPE_NORMAL)
                {
                    fatFingerTh += ptrWdConfig->minFatFingerSizeHyst;
                }
                else
                {
                    /* Fat threshold stays at base (neutral transition down) */
                }

                /* Large object threshold: lower if previously large (stay), raise otherwise */
                if (lastFingerType == CY_CAPSENSE_FINGER_TYPE_LARGE_OBJECT)
                {
                    largeObjTh -= ptrWdConfig->minLargeObjSizeHyst;
                }
                else
                {
                    largeObjTh += ptrWdConfig->minLargeObjSizeHyst;
                }
            }

            /* Clear finger type bits before determining touch object type. */
            ptrWdConfig->ptrWdContext->status &= (uint32_t)(~(uint32_t)CY_CAPSENSE_WD_FINGER_TYPE_MASK);

            /* Clear position */
            newTouch->numPosition = CY_CAPSENSE_POSITION_NONE;

            /* Once large object is detected, latch it until no-touch clears the status */
            if (lastFingerType == CY_CAPSENSE_FINGER_TYPE_LARGE_OBJECT)
            {
                ptrWdConfig->ptrWdContext->status |= ((uint32_t)CY_CAPSENSE_FINGER_TYPE_LARGE_OBJECT << CY_CAPSENSE_WD_FINGER_TYPE_POS);
            }
            else
            {
                /* Determine touch object type. */
                for (idxPeak = advSlider.peakNum; idxPeak-- != 0u;)
                {
                    touchZoneWidth = advSlider.lastZoneIdx[idxPeak] - advSlider.firstZoneIdx[idxPeak] + 1u;
                    
