zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_centroid.c
                    /* Check if touch is large object. */
                    if (touchZoneWidth >= largeObjTh)
                    {
                        if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_FINGER_TYPE_DETECTION_MASK))
                        {
                            /* Feature is disabled, report finger type normal and calculate position as fat finger */
                            ptrWdConfig->ptrWdContext->status |= ((uint32_t)CY_CAPSENSE_FINGER_TYPE_NORMAL << CY_CAPSENSE_WD_FINGER_TYPE_POS);
                            pos = Cy_Capsense_SliderCalculatePositionFatFinger(idxPeak, &advSlider, ptrWdConfig);
                        }
                        else
                        {
                            ptrWdConfig->ptrWdContext->status |= ((uint32_t)CY_CAPSENSE_FINGER_TYPE_LARGE_OBJECT << CY_CAPSENSE_WD_FINGER_TYPE_POS);
                        }
                    }
                    /* Check if touch is fat finger. */
                    else if (touchZoneWidth >= fatFingerTh)
                    {
                        pos = Cy_Capsense_SliderCalculatePositionFatFinger(idxPeak, &advSlider, ptrWdConfig);
                        
                        if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_FINGER_TYPE_DETECTION_MASK))
                        {
                            /* Feature is disabled, report finger type normal */
                            ptrWdConfig->ptrWdContext->status |= ((uint32_t)CY_CAPSENSE_FINGER_TYPE_NORMAL << CY_CAPSENSE_WD_FINGER_TYPE_POS);
                        }
                        else
                        {
                            ptrWdConfig->ptrWdContext->status |= ((uint32_t)CY_CAPSENSE_FINGER_TYPE_FAT << CY_CAPSENSE_WD_FINGER_TYPE_POS);
                        }
                        newTouch->numPosition = CY_CAPSENSE_POSITION_ONE;
                    }
                    /* Touch is normal finger. */
                    else
                    {
                        ptrWdConfig->ptrWdContext->status |= ((uint32_t)CY_CAPSENSE_FINGER_TYPE_NORMAL << CY_CAPSENSE_WD_FINGER_TYPE_POS);
                        pos = Cy_Capsense_SliderCalculatePositionNormalFinger(idxPeak, &advSlider, ptrWdConfig);
                        newTouch->numPosition = CY_CAPSENSE_POSITION_ONE;
                    }

                    newTouch->ptrPosition[0u].x = pos;
                }
            }
        }
    #else
        /* Legacy three-sensor centroid algorithm. */
        if (0u != (ptrWdConfig->centroidConfig & CY_CAPSENSE_CENTROID_3X3_MASK))
        {
            if (snsCount < CY_CAPSENSE_LINEAR_SLIDER_MIN_SNS_COUNT)
            {
                snsCount = CY_CAPSENSE_LINEAR_SLIDER_MIN_SNS_COUNT;
            }

            if (1u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CENTROID_NUMBER_MASK))
            {
                /* Find maximum signal */
                ptrSnsCxt = ptrWdConfig->ptrSnsContext;
                for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
                {
                    if (ptrSnsCxt->diff > maxDiff)
                    {
                        maxDiff = ptrSnsCxt->diff;
                    }
                    ptrSnsCxt++;
                }
                
                /* Find index of sensor with maximum signal */
                ptrSnsCxt = ptrWdConfig->ptrSnsContext;
                for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
                {
                    /* Potential maximum */
                    if (maxDiff == ptrSnsCxt->diff)
                    {
                        /* Get sum of differences around maximum */
                        diffM = (snsIndex > 0u) ? (ptrSnsCxt - 1u)->diff : 0u;
                        diffP = (snsIndex < (snsCount - 1u)) ? (ptrSnsCxt + 1u)->diff : 0u;
                        sum = ptrSnsCxt->diff + diffM + diffP;
                        if (maxSum < sum)
                        {
                            /* New maximum */
                            maxIndex = snsIndex;
                            maxSum = sum;
                            numerator = (int32_t)diffP - (int32_t)diffM;
                        }
                    }
                    ptrSnsCxt++;
                }
                
                if ((maxIndex != CY_CAPSENSE_NO_LOCAL_MAX) && (maxSum > 0u))
                {   
                    /* Calculate position */
                    multiplier = (uint32_t)ptrWdConfig->xResolution << 8u;
                    if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CALC_METHOD_MASK))
                    {
                        multiplier /= (snsCount - 1u);
                        offset = 0u;
                    }
                    else
                    {
                        multiplier /= snsCount;
                        offset = multiplier >> 1u;
                    }
                    
                    denominator = (int32_t)maxSum;
                    denominator = ((numerator * (int32_t)multiplier) / denominator) + (((int32_t)maxIndex * (int32_t)multiplier) + (int32_t)offset);     

                    /* Round result and shift 8 bits left */
                    newTouch->numPosition = CY_CAPSENSE_POSITION_ONE;
                    newTouch->ptrPosition[0u].x = (uint16_t)(((uint32_t)denominator + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
                }
                else
                {
                    newTouch->numPosition = CY_CAPSENSE_POSITION_NONE;
                }
            }
            else
            {
                /* This is a place holder for local maximum searching when number of centroids could be more than one */
            }
        }
    
    #endif
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_LINEAR_SLIDER_EN) */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_RADIAL_SLIDER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpCentroidRadial
****************************************************************************//**
*
* Finds touch position of a Radial slider widget.
*
* In scope of position searching this function finds the local maximum with the
* highest raw count. If such maximums are more than one, then the maximum with 
* bigger sum of neighboring sensors is taken for further processing. Then the position
* is calculated using centroid algorithm with three sensors.
*
* This function does not detect two or more touches.
* 
* \param newTouch
* The pointer to the touch structure where found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpCentroidRadial(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t snsIndex = 0u;
    uint32_t snsCount = ptrWdConfig->numSns;
    
