zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_centroid.c
    uint32_t diffM;
    uint32_t diffP;
    uint32_t sum = 0u;
    uint32_t maxSum = 0u;
    uint32_t maxDiff = 0u;
    uint32_t maxIndex = CY_CAPSENSE_NO_LOCAL_MAX;
    const cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    int32_t numerator = 0;
    int32_t denominator = 0;
    uint32_t multiplier;
    
    if (1u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CENTROID_NUMBER_MASK))
    {
        /* Find maximum signal */
        ptrSnsCxt = ptrWdConfig->ptrSnsContext;
        for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
        {
            if (ptrSnsCxt->diff > maxDiff)
            {
                maxDiff = ptrSnsCxt->diff;
            }
            ptrSnsCxt++;
        }
        
        /* Find index of sensor with maximum signal */
        ptrSnsCxt = ptrWdConfig->ptrSnsContext;
        for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
        {
            /* Potential maximum */
            if (maxDiff == ptrSnsCxt->diff)
            {
                /* Get sum of differences around maximum */
                diffM = (snsIndex > 0u) ? (ptrSnsCxt - 1u)->diff : ptrWdConfig->ptrSnsContext[snsCount - 1u].diff;
                diffP = (snsIndex < (snsCount - 1u)) ? (ptrSnsCxt + 1u)->diff : ptrWdConfig->ptrSnsContext[0u].diff;
                sum = ptrSnsCxt->diff + diffM + diffP;
                if (maxSum < sum)
                {
                    /* New maximum */
                    maxIndex = snsIndex;
                    maxSum = sum;
                    numerator = (int32_t)diffP - (int32_t)diffM;
                }
            }
            ptrSnsCxt++;
        }

        if ((maxIndex != CY_CAPSENSE_NO_LOCAL_MAX) && (maxSum > 0u))
        {   
            /* Calculate position */
            multiplier = ((uint32_t)ptrWdConfig->xResolution << 8u) / snsCount;
            
            denominator = (int32_t)maxSum;
            denominator = ((numerator * (int32_t)multiplier) / denominator) + ((int32_t)maxIndex * (int32_t)multiplier);

            if (denominator < 0)
            {
                denominator += ((int32_t)snsCount * (int32_t)multiplier);
            }
            /* Round result and shift 8 bits left */
            newTouch->numPosition = CY_CAPSENSE_POSITION_ONE;
            newTouch->ptrPosition[0u].x = (uint16_t)(((uint32_t)denominator + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
        }
        else
        {
            newTouch->numPosition = CY_CAPSENSE_POSITION_NONE;
        }
    }
    else
    {
        /* This is a place holder for local maximum searching when number of centroids could be more than one */
    }
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_RADIAL_SLIDER_EN) */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpCentroidTouchpad
****************************************************************************//**
*
* Finds touch position of a CSD Touchpad widget.
*
* In scope of position searching this function finds the local maximum with the
* highest raw count. If such maximums are more than one, then the maximum with 
* bigger sum of neighboring sensors is taken for further processing. Then the position
* is calculated using centroid algorithm with three sensors.
*
* This function does not detect two or more touches.
* 
* \param newTouch
* The pointer to the touch structure where found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpCentroidTouchpad(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t snsIndex = 0u;
    uint32_t snsCount = ptrWdConfig->numSns;
    uint32_t colCount = ptrWdConfig->numCols;
    uint32_t rowCount = ptrWdConfig->numRows;

    uint32_t diffM;
    uint32_t diffP;
    uint32_t sum = 0u;
    uint32_t maxSum = 0u;
    uint32_t maxDiff = 0u;
    uint32_t maxIndex = CY_CAPSENSE_NO_LOCAL_MAX;
    const cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    int32_t numerator = 0;
    int32_t denominator = 0;
    uint32_t multiplier;
    uint32_t offset;

    if (CY_CAPSENSE_TOUCHPAD_MIN_SNS_NUMBER > colCount)
    {
        colCount = CY_CAPSENSE_TOUCHPAD_MIN_SNS_NUMBER;
    }

    if (CY_CAPSENSE_TOUCHPAD_MIN_SNS_NUMBER > rowCount)
    {
        rowCount = CY_CAPSENSE_TOUCHPAD_MIN_SNS_NUMBER;
    }

    if (1u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CENTROID_NUMBER_MASK))
    {
        /***********************************************************************
        * X Axis (Cols)
        ***********************************************************************/
        maxSum = 0u;
        maxDiff = 0u;
        /* Find maximum signal */
        ptrSnsCxt = ptrWdConfig->ptrSnsContext;
        for (snsIndex = 0u; snsIndex < colCount; snsIndex++)
        {
            if (ptrSnsCxt->diff > maxDiff)
            {
                maxDiff = ptrSnsCxt->diff;
            }
            ptrSnsCxt++;
        }
        
        /* Find index of sensor with maximum signal */
        ptrSnsCxt = ptrWdConfig->ptrSnsContext;
        for (snsIndex = 0u; snsIndex < colCount; snsIndex++)
        {
            /* Potential maximum */
            if (maxDiff == ptrSnsCxt->diff)
            {
                /* Get sum of differences around maximum */
                diffM = (snsIndex > 0u) ? (ptrSnsCxt - 1u)->diff : 0u;
                diffP = (snsIndex < (colCount - 1u)) ? (ptrSnsCxt + 1u)->diff : 0u;
                sum = ptrSnsCxt->diff + diffM + diffP;
                /* Check whether this sum is maximum sum */
                if (maxSum < sum)
                {
                    /* New maximum */
                    maxIndex = snsIndex;
                    maxSum = sum;
                    numerator = (int32_t)diffP - (int32_t)diffM;
                }
            }
            ptrSnsCxt++;
        }
        
        if ((maxIndex != CY_CAPSENSE_NO_LOCAL_MAX) && (maxSum > 0u))
        {   
            /* Calculate position */
            multiplier = (uint32_t)ptrWdConfig->xResolution << 8u;
            if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CALC_METHOD_MASK))
            {
                multiplier /= (colCount - 1u);
                offset = 0u;
            }
            else
            {
                multiplier /= colCount;
                offset = multiplier >> 1u;
            }

            denominator = (int32_t)maxSum;
            denominator = ((numerator * (int32_t)multiplier) / denominator) + (((int32_t)maxIndex * (int32_t)multiplier) + (int32_t)offset);

            /* Round result and shift 8 bits left */
            newTouch->numPosition = CY_CAPSENSE_POSITION_ONE;
            newTouch->ptrPosition[0u].x = (uint16_t)(((uint32_t)denominator + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
        }
        else
        {
            newTouch->numPosition = CY_CAPSENSE_POSITION_NONE;
        }

