zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_centroid.c
        if (newTouch->numPosition != CY_CAPSENSE_POSITION_NONE)
        {
            /***********************************************************************
            * Y Axis (Rows)
            ***********************************************************************/
            maxSum = 0u;
            maxDiff = 0u;
            maxIndex = CY_CAPSENSE_NO_LOCAL_MAX;
            /* Find maximum signal */
            ptrSnsCxt = &ptrWdConfig->ptrSnsContext[colCount];
            for (snsIndex = colCount; snsIndex < snsCount; snsIndex++)
            {
                if (ptrSnsCxt->diff > maxDiff)
                {
                    maxDiff = ptrSnsCxt->diff;
                }
                ptrSnsCxt++;
            }

            /* Find index of sensor with maximum signal */
            ptrSnsCxt = &ptrWdConfig->ptrSnsContext[colCount];
            for (snsIndex = 0u; snsIndex < rowCount; snsIndex++)
            {
                /* Potential maximum */
                if (maxDiff == ptrSnsCxt->diff)
                {
                    /* Get sum of differences around maximum */
                    diffM = (snsIndex > 0u) ? (ptrSnsCxt - 1u)->diff : 0u;
                    diffP = (snsIndex < (rowCount - 1u)) ? (ptrSnsCxt + 1u)->diff : 0u;
                    sum = ptrSnsCxt->diff + diffM + diffP;
                    /* Check if this sum is maximum sum */
                    if (maxSum < sum)
                    {
                        /* New maximum */
                        maxIndex = snsIndex;
                        maxSum = sum;
                        numerator = (int32_t)diffP - (int32_t)diffM;
                    }
                }
                ptrSnsCxt++;
            }

            if ((maxIndex != CY_CAPSENSE_NO_LOCAL_MAX) && (maxSum > 0u))
            {
                /* Calculate position */
                multiplier = (uint32_t)ptrWdConfig->yResolution << 8u;
                if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CALC_METHOD_MASK))
                {
                    multiplier /= (rowCount - 1u);
                    offset = 0u;
                }
                else
                {
                    multiplier /= rowCount;
                    offset = multiplier >> 1u;
                }

                denominator = (int32_t)maxSum;
                denominator = ((numerator * (int32_t)multiplier) / denominator) + (((int32_t)maxIndex * (int32_t)multiplier) + (int32_t)offset);

                /* Round result and shift 8 bits left */
                newTouch->ptrPosition[0].y = (uint16_t)(((uint32_t)denominator + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
            }
            else
            {
                newTouch->numPosition = CY_CAPSENSE_POSITION_NONE;
            }
        }
    }
    else
    {
        /* This is a place holder for local maximum searching when number of centroids could be more than one */
    }
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN) */

#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_ADVANCED_CENTROID_5X5_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpAdvancedCentroidTouchpad
****************************************************************************//**
*
* Finds touch position of a CSD touchpad widget using an advanced centroid 
* algorithm.
*
* This function is able to detect two touch positions using a centroid algorithm
* with matrix 5*5 of sensors and virtual sensors on the edges. 
*
* \param newTouch
* The pointer to the touch structure where the found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpAdvancedCentroidTouchpad(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t i;
    const cy_stc_capsense_sensor_context_t * ptrSnsIndex = ptrWdConfig->ptrSnsContext;
    uint16_t * ptrDiffIndex = ptrWdConfig->ptrCsdTouchBuffer;
    cy_stc_capsense_advanced_centroid_config_t advCfg;
    
    advCfg.fingerTh = ptrWdConfig->ptrWdContext->fingerTh;
    advCfg.penultimateTh = ptrWdConfig->advConfig.penultimateTh;
    advCfg.virtualSnsTh = ptrWdConfig->advConfig.virtualSnsTh;
    advCfg.resolutionX = ptrWdConfig->xResolution;
    advCfg.resolutionY = ptrWdConfig->yResolution;
    advCfg.snsCountX = ptrWdConfig->numCols;
    advCfg.snsCountY = ptrWdConfig->numRows;
    advCfg.crossCouplingTh = ptrWdConfig->advConfig.crossCouplingTh;
    advCfg.edgeCorrectionEn = 0u;
    advCfg.twoFingersEn = 0u;
    
    if ((ptrWdConfig->centroidConfig & CY_CAPSENSE_CENTROID_NUMBER_MASK) > CY_CAPSENSE_POSITION_ONE)
    {
        advCfg.twoFingersEn = 1u;
    }
    if (0u != (ptrWdConfig->centroidConfig & CY_CAPSENSE_EDGE_CORRECTION_MASK))
    {
        advCfg.edgeCorrectionEn = 1u;
    }
    for (i = 0u; i < ptrWdConfig->numSns; i++)
    {
        ptrDiffIndex[i] = ptrSnsIndex[i].diff;
    }
    
    Cy_CapSense_AdvancedCentroidGetTouchCoordinates_Lib(
                &advCfg, 
                ptrWdConfig->ptrCsdTouchBuffer, 
                newTouch);
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_ADVANCED_CENTROID_5X5_EN) */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpFindLocalMaxDd
****************************************************************************//**
*
* Finds up to five local maximums for CSX Touchpad.
*
* This function takes an array of differences of the specified widget and 
* finds up to five local maximums. The found maximums are stored in the CSX buffer
* ptrCsxTouchBuffer \ref cy_stc_capsense_csx_touch_buffer_t.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
void Cy_CapSense_DpFindLocalMaxDd(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    const cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdConfig->ptrWdContext;
    const cy_stc_capsense_sensor_context_t * ptrSnsCxt =  ptrWdConfig->ptrSnsContext;
    uint32_t thresholdOff = (uint32_t)ptrWdCxt->fingerTh - ptrWdCxt->hysteresis;
    uint32_t thresholdOn = (uint32_t)ptrWdCxt->fingerTh + ptrWdCxt->hysteresis;
    uint16_t currDiff;
    uint8_t rx;
    uint8_t tx;
    uint8_t snsShift;
    uint8_t lastRx = ptrWdConfig->numCols - 1u;
    uint8_t lastTx = ptrWdConfig->numRows - 1u;
    uint32_t proceed = 0u;
    uint32_t touchNum = 0u;
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];

    for (rx = CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS; rx-- > 0u;)
    {
        ptrNewPeak[rx].id = CY_CAPSENSE_CSX_TOUCHPAD_ID_UNDEFINED;
    }
    
    ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];
    /* Go through all Rx electrodes */
    for (rx = 0u; rx <= lastRx; rx++)
    {
        /* 
        * Go through all Tx and RX (changed above) electrodes intersections 
        * and check whether the local maximum requirement is met.
        */
        for (tx = 0u; tx <= lastTx; tx++)
        {
            proceed = 0u;
            currDiff = ptrSnsCxt->diff;
            if (thresholdOff <= (uint32_t)currDiff)
            {
                /* 
                * Check local maximum requirement: Comparing raw count 
                * of a local maximum candidate with raw counts of sensors 
                * from the previous row.
                */
                if (rx > 0u)
                {
                    /* Check the sensor from the previous row and the next column */
                    snsShift = lastTx;
                    if ((tx < lastTx) && (currDiff <= (ptrSnsCxt - snsShift)->diff))
                    {
                        proceed = 1u;
                    }
                    if (0u == proceed)
                    {
                        /* Check the sensor from the previous row and the same column */
                        snsShift++;
                        if (currDiff <= (ptrSnsCxt - snsShift)->diff)
                        {
                            proceed = 1u;
                        }
                    }
                    if (0u == proceed)
                    {
                        /* Check the sensor from the previous row and the previous column */
                        snsShift++;
                        if ((tx > 0u) && (currDiff <= (ptrSnsCxt - snsShift)->diff))
                        {
                            proceed = 1u;
                        }
                    }
                }
                /* 
                * Check local maximum requirement: Comparing raw count 
                * of a local maximum candidate with raw counts of sensors 
                * from the next row. 
                */
                if ((0u == proceed) && (rx < lastRx))
                {
                    /* Check the sensor from the next row and the next column */
                    snsShift = lastTx + 2u;
                    if ((tx < lastTx) && (currDiff < (ptrSnsCxt + snsShift)->diff))
                    {
                        proceed = 1u;
                    }
                    if (0u == proceed)
                    {
                        /* Check the sensor from the next row and the same column */
                        snsShift--;
                        if (currDiff < (ptrSnsCxt + snsShift)->diff)
                        {
                            proceed = 1u;
                        }
                    }
                    if (0u == proceed)
                    {
                        /* Check the sensor from the next row and the previous column */
                        snsShift--;
                        if ((tx > 0u) && (currDiff < (ptrSnsCxt + snsShift)->diff))
                        {
                            proceed = 1u;
                        }
                    }
                }
                /* 
                * Check local maximum requirement: Comparing raw count 
                * of a local maximum candidate with raw counts of sensors 
                * from the same row and the next column. */
                if ((0u == proceed) && (tx < lastTx))
                {
                    if (currDiff < (ptrSnsCxt + 1u)->diff)
                    {
                        proceed = 1u;
                    }
                }
                /* Check the sensor from the same row and the previous column */
                if ((0u == proceed) && (tx > 0u))
                {
                    if (currDiff <= (ptrSnsCxt - 1u)->diff)
                    {
                        proceed = 1u;
                    }
                }
                /* Add local maximum to the touch structure if there is room. */
                if (0u == proceed)
                {
                    ptrNewPeak->x = rx;
                    ptrNewPeak->y = tx;
                    if (currDiff < thresholdOn)
                    {
                        ptrNewPeak->id |= CY_CAPSENSE_CSX_TOUCHPAD_ID_ON_FAIL;
                    }
                    touchNum++;
                    ptrNewPeak++;
                }
            }
            ptrSnsCxt++;
            if (touchNum >= CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS)
            {
                break;
            }
        }
        if (touchNum >= CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS)
        {
            break;
        }
    }
    ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber = (uint8_t)touchNum;
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN) */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
/* CY_ID633 */
#if defined(__ICCARM__)
    #pragma optimize=none
#endif /* (__ICCARM__) */
/*******************************************************************************
* Function Name: Cy_CapSense_DpCalcTouchPadCentroid
****************************************************************************//**
*
* Calculates the position for each local maximum using the 3x3 algorithm.
*
* This function calculates position coordinates of found local maximums. 
* The found positions are stored in the CSX buffer ptrCsxTouchBuffer 
* \ref cy_stc_capsense_csx_touch_buffer_t.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
void Cy_CapSense_DpCalcTouchPadCentroid(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    const cy_stc_capsense_sensor_context_t * ptrSnsCxt =  ptrWdConfig->ptrSnsContext;
    uint8_t number;
    uint8_t i;
    uint8_t j;
    uint32_t lastRx = (uint32_t)ptrWdConfig->numCols - 1u;
    uint32_t lastTx = (uint32_t)ptrWdConfig->numRows - 1u;
    uint16_t centroid[3u][3u];
    int32_t weightedSumX;
    int32_t weightedSumY;
    uint32_t totalSum;
    uint32_t multiplierX;
    uint32_t offsetX;
    uint32_t multiplierY;
    uint32_t offsetY;
    uint32_t touchNum = ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber;
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0];

    for (number = 0u; number < touchNum; number++)
    {
        /* Set the sensor pointer to the local maximum sensor */
        ptrSnsCxt =  ptrWdConfig->ptrSnsContext;
        ptrSnsCxt += (ptrNewPeak->y + (ptrNewPeak->x * ptrWdConfig->numRows));

