zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_centroid.c
            Cy_CapSense_TouchDownDebounce(ptrWdConfig);
        }
        
        Cy_CapSense_SortByAge(ptrWdConfig);
        newTouchNum = ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber;

        /* Store new touches as old touches */
        ptrWdConfig->ptrCsxTouchHistory->oldPeakNumber = (uint8_t)newTouchNum;
        ptrWdConfig->ptrCsxTouchHistory->oldActiveIdsMask = ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask;
        ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];
        ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[0u];
        for (i = newTouchNum; i-- > 0u;)
        {
            Cy_CapSense_CopyTouchRecord(ptrOldPeak, ptrNewPeak);
            ptrNewPeak++;
            ptrOldPeak++;
        }
    }
 }
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN) */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_TransferTouch
****************************************************************************//**
*
* Transfers a touch from history array into active current array.
*
* This function transfers touch specified by oldIndex from history touch array
* by copying its ID, increments age and decrements debounce (if debounce > 0) 
* parameters into currently active touch structure
*
* \param newIndex 
* The touch index of touch array in the active touch structure.
*
* \param oldIndex 
* The touch index of touch array in the history touch structure.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
static void Cy_CapSense_TransferTouch(
                uint32_t newIndex, 
                uint32_t oldIndex, 
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t touchId;
    uint32_t touchAge;
    uint32_t touchDebounce;
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[newIndex];
    const cy_stc_capsense_position_t * ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[oldIndex];

    touchId = (uint32_t)ptrOldPeak->id & CY_CAPSENSE_CSX_TOUCHPAD_ID_MASK;
    touchAge = ((uint32_t)ptrOldPeak->z & CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK) >> CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT;
    touchDebounce = ((uint32_t)ptrOldPeak->id & CY_CAPSENSE_CSX_TOUCHPAD_DEBOUNCE_MASK) >> CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT;
    
    /* Increase AGE by 1 if possible */
    if (touchAge < CY_CAPSENSE_CSX_TOUCHPAD_MAX_AGE)
    {
        touchAge++;
    }
    /* Decrement Debounce counter if possible */
    if (touchDebounce > 0u)
    {
        touchDebounce--;
    }
    
    ptrNewPeak->id = (uint16_t)(touchId | (uint16_t)(touchDebounce << CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT));
    ptrNewPeak->z &= (uint16_t)~CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK;
    ptrNewPeak->z |= (uint16_t)(touchAge << CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT);
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN) */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_NewTouch
****************************************************************************//**
*
* Set ID, age, and on debounce parameters for a new touch.
*
* If raw count is lower than the finger-On-Threshold,
* then the corresponding touch is marked with CY_CAPSENSE_CSX_TOUCHPAD_ID_ON_FAIL
* in the ID and will be deleted from the new touch structure in Cy_CapSense_SortByAge()
* (new touch structure is reorganized in this case).
*
* \param newIndex
* The touch index of touch array in the active touch structure.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
static void Cy_CapSense_NewTouch(
                uint32_t newIndex,  
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t idx;
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[newIndex];
    
    /* Touch is not accepted */
    if (0u == (ptrNewPeak->id & CY_CAPSENSE_CSX_TOUCHPAD_ID_ON_FAIL))
    {
        /* Create a bit map of ID's currently used and previously used and search for the new lowest ID */
        idx = Cy_CapSense_GetLowestId(ptrWdConfig->ptrCsxTouchHistory->oldActiveIdsMask | 
                ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask);
        
        /* Indicate that ID is now taken */
        ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask |= (uint8_t)(1u << idx);
        
        /* Set AGE */
        ptrNewPeak->z &= (uint16_t)~CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK;
        ptrNewPeak->z |= CY_CAPSENSE_CSX_TOUCHPAD_AGE_START;
        
        /* Set ID and Debounce */
        ptrNewPeak->id = (uint16_t)idx | (uint16_t)(((uint16_t)ptrWdConfig->ptrWdContext->onDebounce - 1u) << CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT);
    }
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN) */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_GetLowestId
****************************************************************************//**
*
* Returns the lowest available free touch ID.
*
* \param idMask 
* The mask of IDs used in active and history touch structures.
*
* \return   
* Returns the lowest available touch ID. If no ID is available,
* CY_CAPSENSE_CSX_TOUCHPAD_ID_ABSENT is returned.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_CapSense_GetLowestId(uint8_t idMask)
{
    uint32_t idx;
    uint32_t touchId = CY_CAPSENSE_CSX_TOUCHPAD_ID_ABSENT;
    uint32_t idMaskLocal = (uint32_t)idMask;

    /* Search for the lowest available ID */
    for (idx = CY_CAPSENSE_CSX_TOUCHPAD_ID_MIN; idx <= CY_CAPSENSE_CSX_TOUCHPAD_ID_MAX; idx++)
    {
        /* Determine whether the new ID is available */
        if (0u == (idMaskLocal & 1u))
        {
            touchId = idx;
            break;
        }

        idMaskLocal >>= 1u;
    }

