zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_centroid.c
    /* Go through all touch fields in the data structure */
    ptrNewPeak = ptrWdConfig->ptrCsxTouchBuffer->newPeak;
    for (i = 0u; i < maxTouch; i++)
    {
        ptrWdTouch->id = CY_CAPSENSE_CSX_TOUCHPAD_ID_UNDEFINED;
    
        if (i < reportedTouchNum)
        {
            /* Report touch to the data structure */
            ptrWdTouch->x = ptrNewPeak->x;
            ptrWdTouch->y = ptrNewPeak->y;
            ptrWdTouch->z = ptrNewPeak->z;
            ptrWdTouch->id = ptrNewPeak->id;
        }
        ptrNewPeak++;
        ptrWdTouch++;
    }
    
    ptrWdConfig->ptrWdContext->wdTouch.numPosition = (uint8_t)reportedTouchNum;
    if (0u == reportedTouchNum)
    {
        ptrWdConfig->ptrWdContext->status &= (uint32_t)~(uint32_t)CY_CAPSENSE_WD_ACTIVE_MASK;
    }
    else
    {
        ptrWdConfig->ptrWdContext->status |= (uint32_t)CY_CAPSENSE_WD_ACTIVE_MASK;
    }
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_TOUCHPAD_EN) */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POSITION_FILTER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_InitPositionFilters
****************************************************************************//**
*
* Initializes history of touch structures by provided current touch states.
*
* \param filterConfig
* The configuration of filters of the widget.
*
* \param ptrInput
* The pointer to the position structure that holds currently detected
* position values.
*
* \param ptrHistory
* The pointer to the position structure that holds previous historical 
* position values.
*
*******************************************************************************/
void Cy_CapSense_InitPositionFilters(
                uint32_t filterConfig,
                const cy_stc_capsense_position_t * ptrInput,
                cy_stc_capsense_position_t * ptrHistory)
{
    cy_stc_capsense_position_t * ptrHistoryIndex = ptrHistory;
    
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POS_MEDIAN_FILTER_EN)
        if (0u != (filterConfig & CY_CAPSENSE_POSITION_MED_MASK))
        {
            *ptrHistoryIndex = *ptrInput;
            ptrHistoryIndex++;
            *ptrHistoryIndex = *ptrInput;
            ptrHistoryIndex++;
        }
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POS_IIR_FILTER_EN)
        if (0u != (filterConfig & CY_CAPSENSE_POSITION_IIR_MASK))
        {
            *ptrHistoryIndex = *ptrInput;
            ptrHistoryIndex++;
        }
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_ADAPTIVE_FILTER_EN)
        if (0u != (filterConfig & CY_CAPSENSE_POSITION_AIIR_MASK))
        {
            ptrHistoryIndex->x = ptrInput->x;
            ptrHistoryIndex->y = ptrInput->y;
            ptrHistoryIndex++;
        }
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POS_AVERAGE_FILTER_EN)
        if (0u != (filterConfig & CY_CAPSENSE_POSITION_AVG_MASK))
        {
            *ptrHistoryIndex = *ptrInput;
            ptrHistoryIndex++;
        }
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POS_JITTER_FILTER_EN)
        if (0u != (filterConfig & CY_CAPSENSE_POSITION_JIT_MASK))
        {
            *ptrHistoryIndex = *ptrInput;
            ptrHistoryIndex++;
        }
    #endif
}


/*******************************************************************************
* Function Name: Cy_CapSense_RunPositionFilters
****************************************************************************//**
*
* Applies enabled filters to position specified by ptrInput argument and stores 
* history into ptrHistory.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
* \param ptrInput
* The pointer to the position structure that holds currently detected
* position values.
*
* \param ptrHistory
* The pointer to the position structure that holds previous historical 
* position values.
*
*******************************************************************************/
void Cy_CapSense_RunPositionFilters(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                cy_stc_capsense_position_t * ptrInput, 
                cy_stc_capsense_position_t * ptrHistory)
{
    #if (CY_CAPSENSE_POS_MEDIAN_FILTER_EN || CY_CAPSENSE_POS_AVERAGE_FILTER_EN)
        uint32_t temp;
    #endif
    uint32_t xPos = ptrInput->x;
    uint32_t yPos = ptrInput->y;
    cy_stc_capsense_position_t * ptrHistoryIndex = ptrHistory;
    uint32_t filterCfg = ptrWdConfig->posFilterConfig;
    #if (0u != CY_CAPSENSE_POS_IIR_FILTER_EN)
        uint32_t coeffIIR = (uint32_t)(filterCfg & CY_CAPSENSE_POSITION_IIR_COEFF_MASK) >> CY_CAPSENSE_POSITION_IIR_COEFF_OFFSET;
    #endif

    #if (0u != CY_CAPSENSE_POS_MEDIAN_FILTER_EN)
        if (0u != (filterCfg & CY_CAPSENSE_POSITION_MED_MASK))
        {
            temp = Cy_CapSense_FtMedian((uint32_t)ptrHistoryIndex[1u].x, (uint32_t)ptrHistoryIndex[0u].x, xPos);
            ptrHistoryIndex[1u].x = ptrHistoryIndex[0u].x;
            ptrHistoryIndex[0u].x = (uint16_t)xPos;
            xPos = temp;
            temp = Cy_CapSense_FtMedian((uint32_t)ptrHistoryIndex[1u].y, (uint32_t)ptrHistoryIndex[0u].y, yPos);
            ptrHistoryIndex[1u].y = ptrHistoryIndex[0u].y;
            ptrHistoryIndex[0u].y = (uint16_t)yPos;
            yPos = temp;
            ptrHistoryIndex++;
            ptrHistoryIndex++;
        }
    #endif

    #if (0u != CY_CAPSENSE_POS_IIR_FILTER_EN)
        if (0u != (filterCfg & CY_CAPSENSE_POSITION_IIR_MASK))
        {
            xPos = Cy_CapSense_FtIIR1stOrder(xPos, (uint32_t)ptrHistoryIndex->x, coeffIIR);
            ptrHistoryIndex->x = (uint16_t)xPos;
            yPos = Cy_CapSense_FtIIR1stOrder(yPos, (uint32_t)ptrHistoryIndex->y, coeffIIR);
            ptrHistoryIndex->y = (uint16_t)yPos;
            ptrHistoryIndex++;
        }
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_ADAPTIVE_FILTER_EN)
        if (0u != (filterCfg & CY_CAPSENSE_POSITION_AIIR_MASK))
        {
            Cy_CapSense_AdaptiveFilterRun_Lib(&ptrWdConfig->aiirConfig, ptrHistoryIndex, &xPos, &yPos);
            ptrHistoryIndex++;
        }
    #endif

    #if (0u != CY_CAPSENSE_POS_AVERAGE_FILTER_EN)
        if (0u != (filterCfg & CY_CAPSENSE_POSITION_AVG_MASK))
        {
            temp = xPos;
            xPos = (xPos + ptrHistoryIndex->x) >> 1u;
            ptrHistoryIndex->x = (uint16_t)temp;
            temp = yPos;
            yPos = (yPos + ptrHistoryIndex->y) >> 1u;
            ptrHistoryIndex->y = (uint16_t)temp;
            ptrHistoryIndex++;
        }
    #endif

    #if (0u != CY_CAPSENSE_POS_JITTER_FILTER_EN)
        if (0u != (filterCfg & CY_CAPSENSE_POSITION_JIT_MASK))
        {
            xPos = Cy_CapSense_FtJitter(xPos, (uint32_t)ptrHistoryIndex->x);
            ptrHistoryIndex->x = (uint16_t)xPos;
            yPos = Cy_CapSense_FtJitter(yPos, (uint32_t)ptrHistoryIndex->y);
            ptrHistoryIndex->y = (uint16_t)yPos;
        }
    #endif
    ptrInput->x = (uint16_t)xPos;
    ptrInput->y = (uint16_t)yPos;
}

#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_POSITION_FILTER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_RunPositionFiltersRadial
****************************************************************************//**
*
* Applies enabled filters to position specified by the ptrInput argument and stores 
* history into ptrHistory. Filtering considers specific widget type where 
* the next value after maximum position is zero and vise versa. 
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
* \param ptrInput
* The pointer to the position structure that holds currently detected
* position values.
*
* \param ptrHistory
* The pointer to the position structure that holds previous historical 
* position values.
*
*******************************************************************************/
void Cy_CapSense_RunPositionFiltersRadial(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                cy_stc_capsense_position_t * ptrInput,
                cy_stc_capsense_position_t * ptrHistory)
{
    /*
    * If new position crosses the zero point in one or another direction, 
    * the position variable with the smaller value is increased by the 
    * slider resolution. This is done for the proper filtering. For 
    * example, xResolution = 100, currPosition = 95, newPosition = 5.
    * If no actions are taken, then the average filter will give a value of 
    * 50 - which is wrong. But if the position values are adjusted as 
    * mentioned here, we will get newPosition equal 105 and the average 
    * will be 100. Later this filtered value will be adjusted further 
    * to not cross the xResolution and it will end up with 0u - which 
    * is correct average result for the provided example.
    */

