zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_centroid.c
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POS_MEDIAN_FILTER_EN)
        uint32_t z1;
        uint32_t z2;
    #endif
    #if (CY_CAPSENSE_POS_IIR_FILTER_EN || CY_CAPSENSE_ADAPTIVE_FILTER_EN || CY_CAPSENSE_POS_AVERAGE_FILTER_EN)
        uint32_t temp;
    #endif
    /* The register contains max position value, so therefore it is increased by 1 */
    uint32_t centroidResolution = (uint32_t)ptrWdConfig->xResolution + 1u;
    uint32_t halfResolution = centroidResolution >> 1u;
    uint32_t xPos = ptrInput->x;
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_ADAPTIVE_FILTER_EN)
        uint32_t yPos = 0u;
    #endif
    cy_stc_capsense_position_t * ptrHistoryIndex = ptrHistory;
    uint32_t filterCfg = ptrWdConfig->posFilterConfig;
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POS_IIR_FILTER_EN)
        uint32_t coeffIIR = (uint32_t)(filterCfg & CY_CAPSENSE_POSITION_IIR_COEFF_MASK) >> CY_CAPSENSE_POSITION_IIR_COEFF_OFFSET;
    #endif
    
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POS_MEDIAN_FILTER_EN)
        if (0u != (filterCfg & CY_CAPSENSE_POSITION_MED_MASK))
        {
            /* Get the filter history for further zero-cross correction */
            z1 = ptrHistoryIndex[0u].x;
            z2 = ptrHistoryIndex[1u].x;
            /* Preserve the filter history without zero-cross correction */
            ptrHistoryIndex[1u].x = ptrHistoryIndex[0u].x;
            ptrHistoryIndex[0u].x = (uint16_t)xPos;
    
            /* Perform zero-cross correction */
            if (z1 > (halfResolution + xPos))
            {
                xPos += centroidResolution;
            }
            if (xPos > (halfResolution + z1))
            {
                z1 += centroidResolution;
                z2 += centroidResolution;
            }
            if (z2 > (halfResolution + z1))
            {
                z1 += centroidResolution;
                xPos += centroidResolution;
            }
            if (z1 > (halfResolution + z2))
            {
                z2 += centroidResolution;
            }

            /* Perform filtering */
            xPos = Cy_CapSense_FtMedian(z2, z1, xPos);
            /* Perform zero-cross correction of filtered position */
            if (xPos >= centroidResolution)
            {
                xPos -= centroidResolution;
            }
            ptrHistoryIndex++;
            ptrHistoryIndex++;
        }
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POS_IIR_FILTER_EN)
        if (0u != (filterCfg & CY_CAPSENSE_POSITION_IIR_MASK))
        {
            /* Perform zero-cross correction */
            if (ptrHistoryIndex->x > (halfResolution + xPos))
            {
                xPos += centroidResolution;
            }
            if (xPos > (halfResolution + ptrHistoryIndex->x))
            {
                ptrHistoryIndex->x += (uint16_t)centroidResolution;
            }
            if (ptrHistoryIndex->x > xPos)
            {
                temp = ptrHistoryIndex->x - xPos;
            }
            else
            {
                temp = xPos - ptrHistoryIndex->x;
            }

            /*
            * IIR filter can accumulate a delay up to a full circle and even more.
            * This situation is not supported by the middleware. If the difference 
            * between the new position and IIR filter history is bigger than 
            * half of resolution, then all enabled position filters are reset.
            */
            if (temp >= halfResolution)
            {
                /* Perform Initialization */
                Cy_CapSense_InitPositionFilters(filterCfg, ptrInput, ptrHistory);
            }
            else
            {
                /* Perform filtering */
                xPos = Cy_CapSense_FtIIR1stOrder(xPos, (uint32_t)ptrHistoryIndex->x, coeffIIR);
                /* Perform zero-cross correction of filtered position */
                if (xPos >= centroidResolution)
                {
                    xPos -= centroidResolution;
                }
                ptrHistoryIndex->x = (uint16_t)xPos;
            }
            ptrHistoryIndex++;
        }
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_ADAPTIVE_FILTER_EN)
        if (0u != (filterCfg & CY_CAPSENSE_POSITION_AIIR_MASK))
        {
            /* Perform zero-cross correction */
            if (ptrHistoryIndex->x > (halfResolution + xPos))
            {
                xPos += centroidResolution;
            }
            if (xPos > (halfResolution + ptrHistoryIndex->x))
            {
                ptrHistoryIndex->x += (uint16_t)centroidResolution;
            }
            if (ptrHistoryIndex->x > xPos)
            {
                temp = ptrHistoryIndex->x - xPos;
            }
            else
            {
                temp = xPos - ptrHistoryIndex->x;
            }
            
            /*
            * IIR filter can accumulate delay up to full circle and even more.
            * This situation is not supported by the middleware. If the difference 
            * between the new position and IIR filter history is bigger than 
            * half of resolution, then all enabled position filters are reset.
            */
            if (temp >= halfResolution)
            {
                /* Perform Initialization */
                Cy_CapSense_InitPositionFilters(filterCfg, ptrInput, ptrHistory);
            }
            else
            {
                /* Perform filtering */
                Cy_CapSense_AdaptiveFilterRun_Lib(&ptrWdConfig->aiirConfig, ptrHistoryIndex, &xPos, &yPos);
                /* Perform zero-cross correction of filtered position */
                if (xPos >= centroidResolution)
                {
                    xPos -= centroidResolution;
                }
                ptrHistoryIndex->x = (uint16_t)xPos;
            }
            ptrHistoryIndex++;
        }
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POS_AVERAGE_FILTER_EN)
        if (0u != (filterCfg & CY_CAPSENSE_POSITION_AVG_MASK))
        {
            temp = xPos;
            /* Perform zero-cross correction */
            if (ptrHistoryIndex->x > (halfResolution + xPos))
            {
                xPos += centroidResolution;
            }
            if (xPos > (halfResolution + ptrHistoryIndex->x))
            {
                ptrHistoryIndex->x += (uint16_t)centroidResolution;
            }
            /* Perform filtering */
            xPos = (xPos + ptrHistoryIndex->x) >> 1u;
            /* Perform zero-cross correction of filtered position */
            if (xPos >= centroidResolution)
            {
                xPos -= centroidResolution;
            }
            ptrHistoryIndex->x = (uint16_t)temp;
            ptrHistoryIndex++;
        }
    #endif

