zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_centroid.c
/*******************************************************************************
* Function Name: Cy_Capsense_SliderDetectTouchZone
****************************************************************************//**
*
* This function searches the diff counts array input to detect peaks based on provided thresholds.
*
* \param ptrAdvSlider 
* The pointer to the advanced slider structure.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
static void Cy_Capsense_SliderDetectTouchZone(
                cy_capsense_advanced_slider_t * ptrAdvSlider,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint16_t snsIndex;
    uint16_t snsCount = ptrWdConfig->numSns;
    uint16_t idxPeak;
    uint16_t idxPeak1;
    uint8_t peakNumLocal;
    uint8_t temp;
    uint8_t strongestPeakIdx = 0u;
    uint16_t strongestPeakDiff;

    /* Delete false peaks */
    for (idxPeak = 0; idxPeak < ptrAdvSlider->peakNum; idxPeak++)
    {
        /* Check if peak exists */
        if (ptrAdvSlider->peakIdx[idxPeak] != 0xFFFFu)
        {
            /* Process for the left side of the touch zone. */
            if (ptrAdvSlider->peakIdx[idxPeak] != 0u)
            {
                for (snsIndex = ptrAdvSlider->peakIdx[idxPeak]; snsIndex-- != 0u;)
                {
                    if ((256u * ptrWdConfig->ptrSnsContext[snsIndex].diff) > (ptrWdConfig->ptrWdContext->fingerSigThMult * ptrWdConfig->ptrSnsContext[ptrAdvSlider->peakIdx[idxPeak]].diff))
                    {
                        if (idxPeak > 0u)
                        {
                            for (idxPeak1 = idxPeak; idxPeak1-- != 0u;)
                            {
                                if (snsIndex == (uint8_t)ptrAdvSlider->peakIdx[idxPeak1])
                                {
                                    ptrAdvSlider->peakIdx[idxPeak1] = 0xFFFFu;
                                }
                            }
                        }
                    }
                    else
                    {
                        break;
                    }
                }
            }

            /* Process for the right side of the touch zone. */
            if ((ptrAdvSlider->peakIdx[idxPeak] + 1u) < snsCount)
            {
                for (snsIndex = (ptrAdvSlider->peakIdx[idxPeak] + 1u); snsIndex < snsCount; snsIndex++)
                {
                    if ((256u * ptrWdConfig->ptrSnsContext[snsIndex].diff) > (ptrWdConfig->ptrWdContext->fingerSigThMult * ptrWdConfig->ptrSnsContext[ptrAdvSlider->peakIdx[idxPeak]].diff))
                    {
                        if (idxPeak < ptrAdvSlider->peakNum)
                        {
                            for (idxPeak1 = (idxPeak + 1u); idxPeak1 < ptrAdvSlider->peakNum; idxPeak1++)
                            {
                                if (snsIndex == ptrAdvSlider->peakIdx[idxPeak1])
                                {
                                    ptrAdvSlider->peakIdx[idxPeak1] = 0xFFFFu;
                                }
                            }
                        }
                    }
                    else
                    {
                        break;
                    }
                }
            }
        }
    }

    /* Recalculate number of peaks. */
    peakNumLocal = 0;
    for (idxPeak = 0; idxPeak < ptrAdvSlider->peakNum; idxPeak++)
    {
        if (ptrAdvSlider->peakIdx[idxPeak] != 0xFFFFu)
        {
            ptrAdvSlider->peakIdx1[peakNumLocal] = ptrAdvSlider->peakIdx[idxPeak];
            peakNumLocal++;
        }
    }
    ptrAdvSlider->peakNum = peakNumLocal;

    /* Keep only the strongest peak (single-touch) */
    if (peakNumLocal > 1u)
    {
        strongestPeakDiff = ptrWdConfig->ptrSnsContext[ptrAdvSlider->peakIdx1[0u]].diff;

        for (idxPeak = 1u; idxPeak < peakNumLocal; idxPeak++)
        {
            if (ptrWdConfig->ptrSnsContext[ptrAdvSlider->peakIdx1[idxPeak]].diff > strongestPeakDiff)
            {
                strongestPeakDiff = ptrWdConfig->ptrSnsContext[ptrAdvSlider->peakIdx1[idxPeak]].diff;
                strongestPeakIdx = (uint8_t)idxPeak;
            }
        }

        ptrAdvSlider->peakIdx1[0u] = ptrAdvSlider->peakIdx1[strongestPeakIdx];
        ptrAdvSlider->peakNum = 1u;
    }

    /* Determine touch zone. */
    for (idxPeak = 0; idxPeak < ptrAdvSlider->peakNum; idxPeak++)
    {
        ptrAdvSlider->firstZoneIdx[idxPeak] = ptrAdvSlider->peakIdx1[idxPeak];
        ptrAdvSlider->lastZoneIdx[idxPeak] = ptrAdvSlider->peakIdx1[idxPeak];
    }

    for (idxPeak = 0; idxPeak < ptrAdvSlider->peakNum; idxPeak++)
    {
        /* Determine the left part of touch zone. */
        if (ptrAdvSlider->peakIdx1[idxPeak] > 0u)
        {
            for (snsIndex = ptrAdvSlider->peakIdx1[idxPeak]; snsIndex-- != 0u;)
            {
                if ((256u * ptrWdConfig->ptrSnsContext[snsIndex].diff) > (ptrWdConfig->ptrWdContext->fingerSigThMult * ptrWdConfig->ptrSnsContext[ptrAdvSlider->peakIdx1[idxPeak]].diff))
                {
                    /* Check if this intersection doesn't belong to another touch zone. */
                    temp = 0u;
                    for (idxPeak1 = ptrAdvSlider->peakNum; idxPeak1-- != 0u;)
                    {
                        if ((idxPeak1 != idxPeak))
                        {
                            if ((ptrAdvSlider->firstZoneIdx[idxPeak1] <= snsIndex) && (snsIndex <= ptrAdvSlider->lastZoneIdx[idxPeak1]))
                            {
                                temp++;
                                break;
                            }
                        }
                    }

                    if (temp == 0u)
                    {
                        ptrAdvSlider->firstZoneIdx[idxPeak] = snsIndex;
                    }
                }
                else
                {
                    break;
                }
            }
        }

        /* Determine the right part of touch zone. */
        if (ptrAdvSlider->peakIdx1[idxPeak] < (snsCount - 1u))
        {
            for (snsIndex = (ptrAdvSlider->peakIdx1[idxPeak] + 1u); snsIndex < snsCount; snsIndex++)
            {
                if ((256u * ptrWdConfig->ptrSnsContext[snsIndex].diff) > (ptrWdConfig->ptrWdContext->fingerSigThMult * ptrWdConfig->ptrSnsContext[ptrAdvSlider->peakIdx1[idxPeak]].diff))
                {
                    /* Check if this intersection doesn't belong to another touch zone. */
                    temp = 0u;
                    for (idxPeak1 = ptrAdvSlider->peakNum; idxPeak1-- != 0u;)
                    {
                        if ((idxPeak1 != idxPeak))
                        {
                            if ((ptrAdvSlider->firstZoneIdx[idxPeak1] <= snsIndex) && (snsIndex <= ptrAdvSlider->lastZoneIdx[idxPeak1]))
                            {
                                temp++;
                                break;
                            }
                        }
                    }

