zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_centroid.c
                    if (temp == 0u)
                    {
                        ptrAdvSlider->lastZoneIdx[idxPeak] = snsIndex;
                    }
                }
                else
                {
                    break;
                }
            }
        }
    }
}


/*******************************************************************************
* Function Name: Cy_Capsense_SliderCalculatePositionNormalFinger
****************************************************************************//**
*
* This function calculates position of the detected normal-finger touch.
*
* \param idxPeak
* Specifies the peak index.
*
* \param ptrAdvSlider 
* The pointer to the advanced slider structure.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
* \return   
* Returns the calculated position.
*
*******************************************************************************/
static uint16_t Cy_Capsense_SliderCalculatePositionNormalFinger(
                uint8_t idxPeak,
                cy_capsense_advanced_slider_t * ptrAdvSlider,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint16_t snsIndex;
    uint16_t maxIndex = ptrAdvSlider->peakIdx1[idxPeak];
    uint16_t maxDiff = ptrWdConfig->ptrSnsContext[maxIndex].diff;
    uint16_t snsCount = ptrWdConfig->numSns;

    uint16_t res = ptrWdConfig->xResolution;
    int32_t centroid[CY_CAPSENSE_INPUT_ARRAY_SIZE] = {0, 0, 0, 0, 0};
    int16_t weightCoeff[CY_CAPSENSE_INPUT_ARRAY_SIZE_HALF + 1] = {0, 256, 512};
    uint16_t calcThreshold = ptrWdConfig->ptrWdContext->calcTh;
    uint16_t offsetOuterEdge = ptrWdConfig->ptrWdContext->offsetOuterEdge;
    uint16_t offsetInnerEdge = ptrWdConfig->ptrWdContext->offsetInnerEdge;
    int32_t denominator;
    int32_t numerator;
    int32_t pos;
    int64_t snsNumTerm;
    int64_t numeratorTerm;

    /* Recalculate peak index as index of the largest sensor in the calculated touch zone. */
    maxDiff = ptrWdConfig->ptrSnsContext[maxIndex].diff;
    for (snsIndex = ptrAdvSlider->firstZoneIdx[idxPeak]; snsIndex <= ptrAdvSlider->lastZoneIdx[idxPeak]; snsIndex++)
    {
        if (ptrWdConfig->ptrSnsContext[snsIndex].diff > maxDiff)
        {
            maxDiff = ptrWdConfig->ptrSnsContext[snsIndex].diff;
            ptrAdvSlider->peakIdx1[idxPeak] = snsIndex;
        }
    }
    maxIndex = ptrAdvSlider->peakIdx1[idxPeak];

    /* Select 5-sensors grid. */
    if (((maxIndex > 1u) && ((ptrWdConfig->ptrSnsContext[maxIndex - 2u].diff) > calcThreshold)))
    {
        centroid[0u] = ((int32_t)ptrWdConfig->ptrSnsContext[maxIndex - 2u].diff) - ((int32_t)calcThreshold);
    }
    if (((maxIndex > 0u) && ((ptrWdConfig->ptrSnsContext[maxIndex - 1u].diff) > calcThreshold)))
    {
        centroid[1u] = ((int32_t)ptrWdConfig->ptrSnsContext[maxIndex - 1u].diff) - ((int32_t)calcThreshold);
    }

    /* centroid[2] is used as devisor in next code and this change to avoid from division on zero exception */
    centroid[2u] = 1;
    if ((maxDiff > calcThreshold))
    {
        centroid[2u] = ((int32_t)maxDiff) - ((int32_t)calcThreshold);
    }
    if (((maxIndex < (snsCount - 1u)) && ((ptrWdConfig->ptrSnsContext[maxIndex + 1u].diff) > calcThreshold)))
    {
        centroid[3u] = ((int32_t)ptrWdConfig->ptrSnsContext[maxIndex + 1u].diff) - ((int32_t)calcThreshold);
    }
    if (((maxIndex < (snsCount - 2u)) && ((ptrWdConfig->ptrSnsContext[maxIndex + 2u].diff) > calcThreshold)))
    {
        centroid[4u] = ((int32_t)ptrWdConfig->ptrSnsContext[maxIndex + 2u].diff) - ((int32_t)calcThreshold);
    }

    /* Set centroid coefficients for outer and inner edge regions of the linear slider. */
    if (((maxIndex == 0u) || (maxIndex == (snsCount - 1u))))
    {
        if (maxIndex == 0u)
        {
            weightCoeff[0u] -= (int16_t)offsetOuterEdge;
        }
        else
        {
            weightCoeff[0u] += (int16_t)offsetOuterEdge;
        }
        
        weightCoeff[1u] += (int16_t)offsetOuterEdge;
        weightCoeff[2u] -= ((int16_t)2 * (int16_t)offsetOuterEdge);
    }
    else if (((maxIndex == 1u) || (maxIndex == (snsCount - 2u))))
    {
        weightCoeff[2u] -= (int16_t)offsetInnerEdge;
    }
    else
    {
        /* Do nothing */
    }

    /* Calculate position on slider. */
    denominator = centroid[0u] + centroid[1u] + centroid[2u] + centroid[3u] + centroid[4u];
    numerator = (((int32_t)weightCoeff[0u] * centroid[2u]) +
                 (((int32_t)weightCoeff[1u] * (centroid[3u] - centroid[1u])) +
                  ((int32_t)weightCoeff[2u] * (centroid[4u] - centroid[0u]))));
    if (0u != (ptrWdConfig->centroidConfig & CY_CAPSENSE_CALC_METHOD_MASK))
    {
        /* SNS_NUM */

        pos = ((int32_t)128 * (int32_t)snsCount) * denominator;
        snsNumTerm = (((int64_t)128 * (int64_t)denominator) * ((2LL * (int64_t)maxIndex) + 1LL));
        numeratorTerm = (snsNumTerm + (int64_t)numerator);
        pos = (int32_t)((((int64_t)res * numeratorTerm) + (int64_t)pos) / (2LL * (int64_t)pos));
    }
    else
    {
        /* SNS_NUM - 1 */

        pos = ((int32_t)128 * (((int32_t)snsCount) - 1)) * denominator;
        snsNumTerm = (((int64_t)256 * (int64_t)maxIndex) * (int64_t)denominator);
        numeratorTerm = (snsNumTerm + (int64_t)numerator);
        pos = (int32_t)((((int64_t)res * numeratorTerm) + (int64_t)pos) / (2LL * (int64_t)pos));
    }

    if (pos < 0)
    {
        pos = 0;
    }
    if (pos > (int32_t)res)
    {
        pos = (int32_t)res;
    }

    return (uint16_t)pos;
}


/*******************************************************************************
* Function Name: Cy_Capsense_SliderCalculatePositionFatFinger
****************************************************************************//**
*
* This function calculates position for fat finger based on signals from whole touch zone.
*
* \param idxPeak
* Specifies the peak index.
*
* \param ptrAdvSlider 
* The pointer to the advanced slider structure.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
* \return   
* Returns the calculated position.
*
*******************************************************************************/
static uint16_t Cy_Capsense_SliderCalculatePositionFatFinger(
                uint8_t idxPeak,
                cy_capsense_advanced_slider_t * ptrAdvSlider,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint16_t snsIndex;
    uint32_t denominator = 0;
    uint32_t numerator = 0;
    uint32_t res = ptrWdConfig->xResolution;
    uint32_t pos;

    for (snsIndex = ptrAdvSlider->firstZoneIdx[idxPeak]; snsIndex <= ptrAdvSlider->lastZoneIdx[idxPeak]; snsIndex++)
    {
        denominator += ptrWdConfig->ptrSnsContext[snsIndex].diff;
        numerator += ((uint32_t)ptrWdConfig->ptrSnsContext[snsIndex].diff * (uint32_t)snsIndex);
    }

    pos = ((uint32_t)ptrWdConfig->numSns) * denominator;
    if (pos > 0u)
    {
        pos = ((res * (denominator + (2u * numerator))) + pos) / (2u * pos);
    }
    else
    {
        pos = 0u;
    }

    if (pos > res)
    {
        pos = res;
    }

    return (uint16_t)pos;
}

#endif /* (CY_CAPSENSE_SLIDER_CENTROID_5X_EN) */




#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP)) */

/* [] END OF FILE */
